#+TITLE: Metric data
#+AUTHOR: Rajesh Gaire
#+auto_tangle: t
#+PROPERTY: header-args:python :tangle ./init.py  :session "true" :results output :export both
#  LocalWords:  Rajesh Gaire args HDI Gini TODO GINI repo readme py
#  LocalWords:  wbdata abc venv txt src datetime GBR gdp 063307e
#  LocalWords:  dtype float64 virtualenv pyvenv eglot


** Testing on the UK
let us use the code that we have writen to get the =GDP= and =GINI coefficent= for the UK.

#+begin_src python :results output :session "true"

country = "GBR"
time = datetime.datetime(2017, 1, 1), datetime.datetime(2017, 1, 1)
  
# gdp_uk = get_gdp(country, time)
gdp_uk = "{:,}".format(get_gdp(country, time))

gini_uk = get_gini(country, time)

print(f"In the UK GDP at 2017 was ${gdp_uk}, and the GINI coefficent at 2017 was: {gini_uk}")

#+end_src

#+RESULTS:
: In the UK GDP at 2017 was $3,063,306,948,134.75, and the GINI coefficent at 2017 was: 35.1

Let us now calculate the metric for the UK.

#+begin_src python :results output :session "true"

metric = float(get_gdp(country, time)) * ((100 - gini_uk)/100)
printable_metric =  "{:,}".format(metric)

print(f"Metric for UK in 2017 was: £{printable_metric}")

#+end_src

#+RESULTS:
: Metric for UK in 2017 was: £1,988,086,209,339.453

This represents

